#!/usr/bin/env python
# --coding: utf-8 --
import arrow

"""
系统菜单模板
"""

# 主菜单
INDEX_MEMU = """
-------------------------------------------------------------------------
                             ATM 模拟程序

{0}                                        今天 {1}   星期{2}
-------------------------------------------------------------------------
        【1】进入商城 【2】信用卡中心 【3】后台管理 【4】退出系统
"""

# 商城用户中心
SHOP_USER_CENTER = """
-------------------------------------------------------------------------
                             购物商城

{0}                                        今天 {1}   星期{2}
-------------------------------------------------------------------------
        【1】进入商城 【3】信用卡中心 【4】后台管理 【5】退出系统
"""

# 信用卡中心
INDEX_ATM = """
------------------------------------------------------------------------------
{0}                                        今天 {1}   星期{2}
                               信用卡管理中心


------------------------------------------------------------------------------
【1】我的信用卡    【2】提现    【3】转账     【4】还款    【5】返回
"""

# 信用卡后台管理
INDEX_ADMIN = """
------------------------------------------------------------------------------
{0}                                        今天 {1}   星期{2}
                               后台管理

用户:{username}
------------------------------------------------------------------------------
【1】创建用户    【2】删除用户    【3】解锁用户   【5】冻结信用卡  【0】退出后台管理
"""

PAGE_DICT = {
    "1": INDEX_MEMU,
    "2": SHOP_USER_CENTER,
    "3": INDEX_ATM,
    "4": INDEX_ADMIN
}


def show_page(page_num="1"):
    """
    导航页面
    """
    week_day = {
        1: "一",
        2: "二",
        3: "三",
        4: "四",
        5: "五",
        6: "六",
        7: "日"
    }
    now = arrow.now()
    hmm = now.strftime("%H:%M:%S")
    ymd = now.strftime("%Y-%m-%d")
    wday = now.isoweekday()
    wday = week_day[wday]
    f_page = PAGE_DICT[page_num].format(hmm, ymd, wday)
    print(f_page)
